app/controllers/shops_controller.rb

SELECT "shops".* FROM "shops"   ORDER BY "shops"."name" ASC
---
  def index
    @shops = Shop.order(:name)

INSERT INTO "shops" ("created_at", "host", "name", "token", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-01-28 15:09:31.949536"], ["host", "123"], ["name", "Teste"], ["token", "a5094780ce92c19ea34d6de8628b7299"], ["updated_at", "2015-01-28 15:09:31.949536"]]
---
  def create
    @shop = Shop.new(shop_params)
    if @shop.save

SELECT  "shops".* FROM "shops"  WHERE "shops"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @shop = Shop.find(params[:id])

SELECT  "shops".* FROM "shops"  WHERE "shops"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "shops" SET "madmimi_api_key" = $1, "madmimi_email" = $2, "updated_at" = $3 WHERE "shops"."id" = 1  [["madmimi_api_key", "123"], ["madmimi_email", "123"], ["updated_at", "2015-01-29 15:46:44.401059"]]
---
  def update
    @shop = Shop.find(params[:id])
    if @shop.update(shop_params)

DELETE FROM "shops" WHERE "shops"."id" = $1  [["id", 1]]
SELECT  "shops".* FROM "shops"  WHERE "shops"."id" = $1 LIMIT 1  [["id", 1]]
---
  def destroy
    Shop.find(params[:id]).destroy!